src/DataProcessors/SabatexExchangeLoadFromFolder.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>SabatexExchangeLoadFromFolder</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>NodeName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FolderName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/sabatexExchangeUnresolvedObjects.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>sabatexExchangeUnresolvedObjects</Name>
			<Comment>Обєкти для яких існують не розвязані посилання</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>objectAsText</Name>
					<Comment>object for send</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Log</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>senderDateStamp</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>serverDateStamp</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>levelLive</Name>
					<Comment>кількість спроб опрацювань</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dateStamp</Name>
					<Comment>Дата втановлення в чергу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>MessageHeader</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>NodeName</Name>
					<Comment>Назва вузла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/SabatexExchangeLoadFromFolder/Forms/Form/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	nodes = SabatexExchange.GetActiveDestinationNodes();
	for each node in nodes do
		Items.NodeSelector.ChoiceList.Add(node);
	EndDo;

EndProcedure

&AtServer
procedure AddUnresolvedObject(nodeName,objectType,id,json)
	messageHeader = SabatexExchange.GetObjectHeader(objectType,id);
	reg = InformationRegisters.sabatexExchangeUnresolvedObjects.CreateRecordManager();
	//reg.sender = new UUID(item["sender"]);
	reg.MessageHeader = messageHeader;

	reg.dateStamp = CurrentDate();
	reg.serverDateStamp= CurrentDate();
	reg.senderDateStamp =CurrentDate();
	reg.objectAsText = json;
	reg.NodeName = nodeName;
	reg.Log = "Завантажено з файла";
	reg.Write();
endprocedure
	

&AtClient
Procedure LoadData(Command)
	folder =   new File(Object.FolderName);
	
	if not folder.Exists() then
		Message("Не знайдено каталог - " + Object.FolderName);
		return;
	endif;	
	
	for each file in FindFiles(Object.FolderName,"*.json") do
	   spacePos = StrFind(file.Name," ");	
	   objectType =	Mid(file.Name,1,spacePos-1);
	   id = Mid(file.Name,spacePos+1);
	   id = Mid(id,1,StrFind(id,".")-1);
	   t = new TextDocument;
	   t.Read(file.FullName);
	   
       AddUnresolvedObject(Object.NodeName,objectType,id,t.GetText());
	enddo;	


EndProcedure
